{
  "projects": [
    {
      "client": "Toptracer (Consultant from Netlight)",
      "projectName": "Toptracer Community App",
      "description": "Toptracer develops a golf range experience where the ball is tracked for playing games on a monitor or a mobile phone. I develop new features and enhance application quality. Accomplishments include introducing test-driven development and revamping the architecture and DevOps integration between Unity and Android, enabling the Android team to implement cutting-edge solutions.",
      "company": "Netlight",
      "city": "Stockholm",
      "country": "Sweden",
      "position": "Senior Software Engineer",
      "startDate": "1/1/2022",
      "endDate": "Current"
    },
    {
      "client": "TV4 (Consultant from Netlight)",
      "projectName": "Telia Play TV Box",
      "description": "Developing the latest Telia Play Android Embedded TV box as a part of a team working in a mono repo containing code for three different platforms (Mobile, TV, and TV box) and three different streaming services (TV4 Play, Telia Play, and CMORE). Using State-of-the-art Android methodology, we maintained a project with around 50 modules.",
      "company": "Netlight",
      "city": "Stockholm",
      "country": "Sweden",
      "position": "Senior Software Engineer",
      "startDate": "1/5/2021",
      "endDate": "31/12/2021"
    },
    {
      "client": "Fashion Retail Company (Consultant from Accenture)",
      "projectName": "E-commerce Android Application",
      "description": "Maintenance and feature development for an e-commerce Android application for a large fashion retail company. Most development was done with Kotlin as we were migrating our application from JAVA.",
      "company": "Accenture",
      "city": "Stockholm",
      "country": "Sweden",
      "position": "Software Engineer",
      "startDate": "1/5/2019",
      "endDate": "31/4/2021"
    },
    {
      "client": "Volvo Cars",
      "projectName": "Infotainment System",
      "description": "Worked with the infotainment system, which used Android Auto together with a UNIX kernel. In my day-to-day work, I used both Android for the front end and C++ for the business logic. Also used Python for crafting automated UI tests. Worked collaboratively with Google as pioneers in Android Auto. Worked with vehicle functions, e.g. HVAC and Active Safety, requiring a lot of cooperation with other teams.",
      "company": "Volvo Cars",
      "city": "Gothenburg",
      "country": "Sweden",
      "position": "Software Engineer",
      "startDate": "1/9/2016",
      "endDate": "31/4/2019"
    }
  ]
}
